lfazio/rv32cortex-m/src/platform/stm32f446/board.c
/* SPDX-License-Identifier: Apache-2.0 */
/*
 * board.c - Nucleo-F446RE bring-up.
 *
 * STM32F446RE: Cortex-M4F at 180 MHz, 512 KiB flash, 128 KiB of RAM.
 * References are RM0390 for the part and UM1724 for the board.
 *
 * Everything here is board fact rather than emulator policy, which is what
 * makes it the file to read when porting. Comparing it against the F746's
 * copy is the shortest description of what changes between the two.
 */

#include "board.h"

#include "stm32f4xx_hal.h"

#include <stdbool.h>

static UART_HandleTypeDef g_console;

static void Error_Handler(void)
{
    __disable_irq();
    for (;;) {
        /* A failure this early cannot be reported; halt so a debugger can
         * see where we stopped. */
    }
}

/* ------------------------------------------------------------------ */
/* Clock tree                                                          */
/* ------------------------------------------------------------------ */

/*
 * 180 MHz from the internal 16 MHz HSI.
 *
 * HSI rather than HSE because this board ships without a populated
 * crystal, and the ST-LINK MCO path depends on solder-bridge options that
 * vary between board revisions; HSI works on an unmodified board.
 *
 *   HSI 16 MHz / PLLM 8 = 2 MHz -> x PLLN 180 = 360 MHz -> / PLLP 2 = 180
 */
static void clock_init(void)
{
    RCC_OscInitTypeDef osc = { 0 };
    RCC_ClkInitTypeDef clk = { 0 };

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    osc.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    osc.HSIState = RCC_HSI_ON;
    osc.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    osc.PLL.PLLState = RCC_PLL_ON;
    osc.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    osc.PLL.PLLM = 8;
    osc.PLL.PLLN = 180;
    osc.PLL.PLLP = RCC_PLLP_DIV2;
    osc.PLL.PLLQ = 4;
    osc.PLL.PLLR = 2;
    if (HAL_RCC_OscConfig(&osc) != HAL_OK) {
        Error_Handler();
    }

    /* Over-drive is mandatory above 168 MHz on this part. */
    if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
        Error_Handler();
    }

    clk.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                    RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clk.APB1CLKDivider = RCC_HCLK_DIV4;    /* 45 MHz, APB1 max */
    clk.APB2CLKDivider = RCC_HCLK_DIV2;    /* 90 MHz, APB2 max */
    if (HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_5) != HAL_OK) {
        Error_Handler();
    }

    /*
     * No peripheral kernel clock selection here, unlike the F7: on this
     * family a USART simply runs from its APB clock. That is one of the
     * differences the split makes visible.
     */
}

/* ------------------------------------------------------------------ */
/* Console                                                             */
/* ------------------------------------------------------------------ */

static void console_init(void)
{
    /* USART2, which is where a Nucleo-64 wires the ST-LINK VCP. */
    g_console.Instance = USART2;
    g_console.Init.BaudRate = 921600;
    g_console.Init.WordLength = UART_WORDLENGTH_8B;
    g_console.Init.StopBits = UART_STOPBITS_1;
    g_console.Init.Parity = UART_PARITY_NONE;
    g_console.Init.Mode = UART_MODE_TX_RX;
    g_console.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    g_console.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&g_console) != HAL_OK) {
        Error_Handler();
    }
}

/* Called by HAL_UART_Init. */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    GPIO_InitTypeDef gpio = { 0 };

    if (huart->Instance != USART2) {
        return;
    }

    __HAL_RCC_USART2_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* PA2 = USART2_TX, PA3 = USART2_RX, both AF7. */
    gpio.Pin = GPIO_PIN_2 | GPIO_PIN_3;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &gpio);
}

void board_console_putc(uint8_t c)
{
    /* Blocking, with a generous timeout: output is for humans, and losing
     * a byte is worse than stalling briefly. */
    HAL_UART_Transmit(&g_console, &c, 1u, 100u);
}

/* ------------------------------------------------------------------ */
/* Interrupt-driven receive                                            */
/* ------------------------------------------------------------------ */

/*
 * See the F746's copy for why this is necessary rather than an
 * optimisation: the USART holds one byte and the run loop reaches it
 * once per guest slice, so any framed protocol on this wire needs the
 * bytes taken by an interrupt.
 *
 * The F4 differences are all in the register names. Status and the
 * error flags share SR, and SR is cleared by reading it and then DR --
 * there is no ICR to write, so the read below is what dismisses an
 * overrun. Missing that leaves ORE latched and RXNE never sets again.
 */
#define RX_RING_SIZE 2048u
#define RX_RING_MASK (RX_RING_SIZE - 1u)

static uint8_t  g_rx_ring[RX_RING_SIZE];
static volatile uint32_t g_rx_head;
static uint32_t g_rx_tail;
static volatile uint32_t g_rx_overrun;
static bool     g_rx_irq;

/* USART2 on a Nucleo-64, which is board.c's fact to own -- see the F746. */
void USART2_IRQHandler(void)
{
    USART_TypeDef *const u = g_console.Instance;
    const uint32_t sr = u->SR;

    if ((sr & (USART_SR_RXNE | USART_SR_ORE)) != 0u) {
        const uint8_t c = (uint8_t)(u->DR & 0xFFu);   /* also clears ORE */

        if ((sr & USART_SR_ORE) != 0u) {
            g_rx_overrun++;
        }
        if ((sr & USART_SR_RXNE) != 0u) {
            if ((g_rx_head - g_rx_tail) < RX_RING_SIZE) {
                g_rx_ring[g_rx_head & RX_RING_MASK] = c;
                g_rx_head++;
            } else {
                g_rx_overrun++;
            }
        }
    }
}

void board_console_rx_irq_enable(void)
{
    if (g_rx_irq) {
        return;
    }
    g_rx_irq = true;

    HAL_NVIC_SetPriority(USART2_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
    __HAL_UART_ENABLE_IT(&g_console, UART_IT_RXNE);
}

int board_console_getc(void)
{
    if (g_rx_irq) {
        if (g_rx_head == g_rx_tail) {
            return -1;
        }
        return (int)g_rx_ring[g_rx_tail++ & RX_RING_MASK];
    }

    /* DR, one register for both directions -- the F7 splits it into
     * RDR and TDR. */
    if (__HAL_UART_GET_FLAG(&g_console, UART_FLAG_RXNE)) {
        return (int)(g_console.Instance->DR & 0xFFu);
    }
    return -1;
}

uint32_t board_console_rx_overruns(void)
{
    return g_rx_overrun;
}

/* ------------------------------------------------------------------ */
/* Cycle counter                                                       */
/* ------------------------------------------------------------------ */

static void dwt_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

    /*
     * No DWT->LAR write, and that is not an omission. The software lock is
     * optional in ARMv7-M; this part does not implement it, so the write
     * would be harmless but says nothing. The Cortex-M7 does implement it,
     * and without the unlock its cycle counter never starts -- see the
     * F746's copy of this file.
     */
    DWT->CYCCNT = 0u;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

uint32_t board_cycles(void)
{
    return DWT->CYCCNT;
}

/* ------------------------------------------------------------------ */

const char *board_name(void) { return "Cortex-M4"; }

uint32_t board_clock_hz(void) { return SystemCoreClock; }

void board_hw_init(void)
{
    /*
     * No caches to enable: this part has only the ART flash accelerator,
     * which is transparent. board_sync_icache is defined for every STM32
     * in src/platform/stm32/cache.c and compiles to an empty function
     * here, because CMSIS's __DCACHE_PRESENT says so -- not because this
     * board declines to define it. The difference matters: a platform
     * that leaves the symbol out is a link error, which is what the M55
     * port wanted and did not get while the definition was weak.
     */
    HAL_Init();
    clock_init();
    console_init();
    dwt_init();
}

/* ------------------------------------------------------------------ */
/* Link activity LED                                                   */
/* ------------------------------------------------------------------ */

/*
 * LD2, the Nucleo-F446RE's only user LED, on PA5. Both directions share
 * it -- see the note in board.h.
 */
#define LED_PORT   GPIOA
#define LED_PIN    GPIO_PIN_5

void board_led_toggle(board_led_t led)
{
    static bool inited;

    (void)led;

    if (!inited) {
        GPIO_InitTypeDef gpio = { 0 };

        __HAL_RCC_GPIOA_CLK_ENABLE();
        gpio.Pin = LED_PIN;
        gpio.Mode = GPIO_MODE_OUTPUT_PP;
        gpio.Pull = GPIO_NOPULL;
        gpio.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(LED_PORT, &gpio);
        inited = true;
    }
    HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
}

void board_wfi(void)
{
    __WFI();
}

void board_fatal(int *status)
{
    (void)status;

    __disable_irq();
    for (;;) {
        /* No console to report on: halt so a debugger sees where. */
    }
}

/* ------------------------------------------------------------------ */
/* The guest-image arena: this board has none                          */
/* ------------------------------------------------------------------ */

/*
 * Uploading a guest needs somewhere to put it that survives the reload,
 * and this part's flash is not it: the firmware occupies the low sectors
 * and the rest is 128 KiB sectors, so an erase would have to take the
 * whole of the remainder at once. Everything else the network offers
 * works here -- ping, the telnet console, the gdb stub.
 *
 * A zero size is the whole of how a board declines. The runner tests it
 * at run time and the compiler folds the branch, so this costs nothing
 * and needs no #if anywhere.
 */
uintptr_t board_flash_arena_base(void)  { return 0u; }
uint32_t board_flash_arena_size(void)  { return 0u; }
uintptr_t board_flash_arena_begin(void) { return 0u; }
void     board_flash_arena_commit(uint32_t len) { (void)len; }
bool     board_flash_arena_reset(void) { return false; }
uint32_t board_flash_last_error(void)  { return 0u; }

bool board_flash_write(uintptr_t addr, const void *data, uint32_t len)
{
    (void)addr; (void)data; (void)len;
    return false;
}
